spacer_8 = '<*><*><*><*><*><*><*><*>'
spacer_16 = '<*><*><*><*><*><*><*><*><*><*><*><*><*><*><*><*>'
greeting = '<*><*> Willkommen beim Passwortgenerator! <*><*>'


def loading():
    print(' ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▢ \n'
          '   ╭━╮╭━╮ ╭╮　╱  \n'
          '   ╰━┫╰━┫ ╰╯╱╭╮ \n'
          '   ╰━╯╰━╯ ╱  ╰╯  COMPLETE \n ')


def bye():
    print('Vielen Dank  für das Benutzen des PyPW-Generator \n'
          'Programmiert von N3ros\n'
          'Auf Wiedersehen\n'
          '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣤⣤⣤⣤⣶⣦⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⡿⠛⠉⠙⠛⠛⠛⠛⠻⢿⣿⣷⣤⡀⠀⠀⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⠋⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠈⢻⣿⣿⡄⠀⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⣸⣿⡏⠀⠀⠀⣠⣶⣾⣿⣿⣿⠿⠿⠿⢿⣿⣿⣿⣄⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⣿⣿⠁⠀⠀⢰⣿⣿⣯⠁⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣷⡄⠀\n'
          '⠀⠀⣀⣤⣴⣶⣶⣿⡟⠀⠀⠀⢸⣿⣿⣿⣆🔴⠀⠀⠀⠀🔴⠀⠀⣿⣷⠀\n'
          '⠀⢰⣿⡟⠋⠉⣹⣿⡇⠀⠀⠀⠘⣿⣿⣿⣿⣷⣦⣤⣤⣤⣶⣶⣶⣶⣿⣿⣿\n'
          '⠀⢸⣿⡇⠀⠀⣿⣿⡇⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠀\n'
          '⠀⣸⣿⡇⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠉⠻⠿⣿⣿⣿⣿⡿⠿⠿⠛⢻⣿⡇⠀⠀\n'
          '⠀⣿⣿⠁⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣧⠀⠀\n'
          '⠀⣿⣿⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀\n'
          '⠀⣿⣿⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀\n'
          '⠀⢿⣿⡆⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⠀\n'
          '⠀⠸⣿⣧⡀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠃⠀⠀\n'
          '⠀⠀⠛⢿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⣰⣿⣿⣷⣶⣶⣶⣶⠶⠀⢠⣿⣿⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⣿⣿⡇⠀⣽⣿⡏⠁⠀⠀⢸⣿⡇⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⣿⣿⡇⠀⢹⣿⡆⠀⠀⠀⣸⣿⠇⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⢿⣿⣦⣄⣀⣠⣴⣿⣿⠁⠀⠈⠻⣿⣿⣿⣿⡿⠏⠀⠀⠀⠀\n'
          '⠀⠀⠀⠀⠀⠀⠀⠈⠛⠻⠿⠿⠿⠿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ \n')


def welcome_msg():
    print(spacer_16)
    print(greeting)
    print(spacer_16)


welcome_msg()

while True:
    import random
    import string
    import time
    length = (input('\n Wie lang soll das Passwort sein?'))

    if not length.isdecimal():
        print('\n' + spacer_8 + "\nBitte eine Zahl eingeben.\n" + spacer_8 + '\n')

    else:
        length = int(length)

        lower = string.ascii_lowercase
        upper = string.ascii_uppercase
        num = string.digits
        sym = string.punctuation

        pw_symbols = lower + upper + num + sym

        temp = random.sample(pw_symbols, length)

        password = "".join(temp)

        print('  generating new Password \n ')
        loading()
        print('Ihr generiertes Passwort lautet \n')
        print(spacer_8 + '\n\n' + password + '\n \n' + spacer_8)

        new_try = input('Möchten Sie noch ein Passwort generieren? Y/N \n')

        if new_try == 'Y' or new_try == 'y':
            print('restructuring the time-space-coefficient\n')
            loading()
            continue
        else:
            bye()
            print('Das Programm schließt sich in 7 Sekunden von alleine')
            time.sleep(7)
            break
